In [12]:
import pandas as pd

In [14]:
pd

In [16]:
#Series  data str 
a = pd.Series([1,34,67,90])
a

0     1
1    34
2    67
3    90
dtype: int64

In [18]:
type(a)

pandas.core.series.Series

In [30]:
# dataframe datastr
a = {
    "emp_id" : [1,2,3],
    "NAME": ["NIKI","RADHHA","VINY"],
    "WORKING_HRS" :[8,8,9],
    "Salary": [25000,30000,45000]
}
a

{'emp_id': [1, 2, 3],
 'NAME': ['NIKI', 'RADHHA', 'VINY'],
 'WORKING_HRS': [8, 8, 9],
 'Salary': [25000, 30000, 45000]}

In [32]:
type(a)

dict

In [34]:
df =pd.DataFrame(a)

In [36]:
df

   emp_id    NAME  WORKING_HRS  Salary
0       1    NIKI            8   25000
1       2  RADHHA            8   30000
2       3    VINY            9   45000

In [48]:
#how can we export or impoort dataframe
#for export
df.to_csv("C:\\Users\\KMC\\Desktop\\pandas\\emp_info.csv",index = False)

In [50]:
#for import

In [58]:
df2 =pd.read_csv("C:\\Users\\KMC\\Desktop\\pandas\\emp_info.csv")
df2

   emp_id    NAME  WORKING_HRS  Salary
0       1    NIKI            8   25000
1       2  RADHHA            8   30000
2       3    VINY            9   45000

In [64]:
df.to_excel("C:\\Users\\KMC\\Desktop\\pandas\\emp_info.xlsx")

In [68]:
pd.read_excel("C:\\Users\\KMC\\Desktop\\pandas\\emp_info.xlsx")

   Unnamed: 0  emp_id    NAME  WORKING_HRS  Salary
0           0       1    NIKI            8   25000
1           1       2  RADHHA            8   30000
2           2       3    VINY            9   45000